IDENTIFICATION DIVISION.
PROGRAM-ID. E-Calculation-Steve28.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 i BINARY-LONG.
01 j PIC S9(30) VALUE 1.
01 k BINARY-LONG.
01 e PIC S9(1)V9(20) VALUE 1.0.
01 n BINARY-LONG.

PROCEDURE DIVISION.
ACCEPT n.
PERFORM VARYING k FROM 1 BY 1 UNTIL k > n
    PERFORM VARYING i FROM 1 BY 1 UNTIL i > k
        MULTIPLY j BY i GIVING j
    END-PERFORM
    MOVE 1 TO i
    COMPUTE e = e + 1/j
    MOVE 1 TO j
END-PERFORM
DISPLAY e
STOP RUN.
