IDENTIFICATION DIVISION.
PROGRAM-ID. Fibonacci-Steve28.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a BINARY-LONG VALUE 0.
01 b BINARY-LONG VALUE 1.
01 c BINARY-LONG VALUE 1.
01 i BINARY-LONG.
01 n BINARY-LONG.

PROCEDURE DIVISION.
DISPLAY "Input a Number!".
ACCEPT n.
PERFORM VARYING i FROM 1 BY 1 UNTIL i > n
    MOVE b TO c
    ADD a TO b
    MOVE c TO a
END-PERFORM
DISPLAY a
STOP RUN.
