IDENTIFICATION DIVISION.
PROGRAM-ID. Star-Pyramid-Steve28.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 i BINARY-LONG.
01 j BINARY-LONG.
01 n BINARY-LONG.
01 STAR PIC X(100) VALUE SPACES.

PROCEDURE DIVISION.
ACCEPT n.
PERFORM VARYING i FROM 1 BY 1 UNTIL i > n
    PERFORM VARYING j FROM 1 BY 1 UNTIL j > i
        STRING STAR DELIMITED BY SPACES
                "*" DELIMITED BY SPACES
                INTO STAR
    END-PERFORM
    DISPLAY STAR
    MOVE SPACES TO STAR
END-PERFORM
STOP RUN.
